//Прибрати всі дублікати з слайсу int.
//Приклад даних на вхід: [3, 4, 4, 3, 6, 3]
//видаляємо 3 по індексу 0
//видаляємо 4 по індексу 1
//видаляємо 3 по індексу 3
//Правильний результат: [3, 4, 6]
//Якщо вам потрібні змінні чи константи - вони мають бути локальними, в межах функції main.
//func main(){
//arr := []int{4, 1, 4, -4, 6, 3, 8, 8}
//var result []int
//...
// тут має бути ваш код
// змінна result в кінці функції має тримати слайс з вже видаленими дублікатами відповідно до правил

package main

import "fmt"

func main() {
	// ініціалізуємо масиви
	arr := []int{3, 4, 4, 3, 6, 3}
	var result []int
	m := make(map[int]int)

	// За допомогою логіки мап записуємо лише унікальні значення масиву
	for _, v := range arr {
		m[v] = v
	}
	// Переписуємо значення з мап до масиву
	for _, v := range m {
		result = append(result, v)
	}

	fmt.Println(result)
}
